app/Models/SuperAdmin/ArsipModel.php

    public function ajaxGetData($length, $start)
    {
        // $result = $this->orderBy('id', 'desc')
        //     ->findAll($length, $start);
        $result = $this->select(
            'arsip.id, arsip.no_arsip, arsip.nama_arsip, arsip.file_arsip, arsip.ukuran_file,
            arsip.deskripsi, arsip.status, arsip.created_at, arsip.updated_at, departemen.nama_departemen, kategori.nama_kategori, user.nama_user'
        )
            ->join('departemen', 'departemen.id = arsip.id_departemen', 'inner')
            ->join('kategori', 'kategori.id = arsip.id_kategori', 'inner')
            ->join('user', 'user.id = arsip.id_user', 'inner')
            ->orderBy('id', 'desc')
            ->findAll($length, $start);
---
SELECT `arsip`.`id`, `arsip`.`no_arsip`, `arsip`.`nama_arsip`, `arsip`.`file_arsip`, `arsip`.`ukuran_file`, `arsip`.`deskripsi`, `arsip`.`status`, `arsip`.`created_at`, `arsip`.`updated_at`, `departemen`.`nama_departemen`, `kategori`.`nama_kategori`, `user`.`nama_user`
FROM `arsip`
INNER JOIN `departemen` ON `departemen`.`id` = `arsip`.`id_departemen`
INNER JOIN `kategori` ON `kategori`.`id` = `arsip`.`id_kategori`
INNER JOIN `user` ON `user`.`id` = `arsip`.`id_user`
ORDER BY `id` DESC
 LIMIT 10

    public function getDetailArsip($kode_arsip)
    {
        $result = $this->select(
            'arsip.id, arsip.no_arsip, arsip.nama_arsip, arsip.file_arsip, arsip.ukuran_file,
            arsip.deskripsi, arsip.status, arsip.created_at, arsip.updated_at, departemen.nama_departemen, kategori.nama_kategori, user.nama_user'
        )
            ->join('departemen', 'departemen.id = arsip.id_departemen', 'inner')
            ->join('kategori', 'kategori.id = arsip.id_kategori', 'inner')
            ->join('user', 'user.id = arsip.id_user', 'inner')
            ->orderBy('id', 'desc')
            ->where('no_arsip', $kode_arsip)
            ->get()->getRowArray();
---
SELECT `arsip`.`id`, `arsip`.`no_arsip`, `arsip`.`nama_arsip`, `arsip`.`file_arsip`, `arsip`.`ukuran_file`, `arsip`.`deskripsi`, `arsip`.`status`, `arsip`.`created_at`, `arsip`.`updated_at`, `departemen`.`nama_departemen`, `kategori`.`nama_kategori`, `user`.`nama_user`
FROM `arsip`
INNER JOIN `departemen` ON `departemen`.`id` = `arsip`.`id_departemen`
INNER JOIN `kategori` ON `kategori`.`id` = `arsip`.`id_kategori`
INNER JOIN `user` ON `user`.`id` = `arsip`.`id_user`
WHERE `no_arsip` = '112237'
ORDER BY `id` DESC

    public function ajaxGetTotal()
    {
        $result = $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `arsip`