app/Models/SuperAdmin/DepartemenModel.php

    public function ajaxGetData($length, $start)
    {
        $result = $this->orderBy('id', 'desc')
            ->findAll($length, $start);
---
SELECT *
FROM `departemen`
ORDER BY `id` DESC
 LIMIT 10

    public function ajaxGetTotal()
    {
        $result = $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `departemen`